// Обʼєкти
// Завдання
// Створіть об’єкт, що описує прямокутник (зберігає координа- ти ліво верхньо та право
// нижньо точок), і напишіть наступні функці для роботи з таким об’єктом
// 1. Функція при має об’єкт-прямокутник і виводить інфор- мацію про нього (де яка точка
// розташована).
// 2. Функція при має об’єкт-прямокутник і повертає ого ширину.
// 3. Функція при має об’єкт-прямокутник і повертає ого висоту.
// 4. Функція при має об’єкт-прямокутник і повертає ого площу.
// 5. Функція при має об’єкт-прямокутник і повертає ого периметр.
// 6. Функція зміни ширини прямокутника. Вона при має об’єкт-прямокутник і на скільки
// одиниць змінити шири- ну.
// 7. Функція зміни висоти прямокутника. Вона при має об’єкт-прямокутник і на скільки
// одиниць змінити висоту.
// 8. Функція зміни ширини та висоти прямокутника. Вона при має об’єкт-прямокутник та два
// значення для зміни ширини та висоти.
// 9. Функція зміщення прямокутника по осі X. Вона при має об’єкт-прямокутник і на скільки
// одиниць ого зрушити.
// 10. Функція зміщення прямокутника по осі Y. Вона при має об’єкт-прямокутник і на скільки
// одиниць ого зрушити.