// Функції
// Завдання
// 1. Напишіть функцію, яка при має 2 числа та повертає мен- ше з них.
// 2. Напишіть функцію, яка зводить передане число у вказани ступінь.
// 3. Напишіть функцію, яка при має 2 числа та знак (+ - * /), підраховує приклад і повертає
// результат.
// 4. Напишіть функцію, яка перевіряє, чи є передане число простим.
// 5. Напишіть функцію, яка при має число і виводить табли- цю множення для цього числа.
// Викличте функцію для всіх чисел від 2 до 9.
// 6. Напишіть функцію, яка реалізує роботу оператора %. Функ- ція при має 2 параметри та
// повертає залишок від ділення першого параметра на други . У функці використову те
// тільки + - * /, а оператор % не використовувати.
// 7. Напишіть функцію, яка при має від 1 до 5 чисел і повертає х суму.
// 8. Напишіть функцію, яка при має від 1 до 5 чисел і повертає більше з них.
// 1
// Практичне завдання 4
// 9. Напишіть функцію, яка виводить усі парні або непарні числа у вказаному користувачем
// діапазоні. Які числа ви- водити, визначається третім параметром типу bool (true – парні,
// false – непарні).
// 10. Напишітьфункцію,якапри маєдату(день,місяць,рік)і повертає дату наступного дня у
// вигляді рядка «день.місяць. рік». Перевірку на високосни рік бажано написати окре- мою
// функцією.